In [18]:
import pandas as pd
import numpy as np
import sqlite3
db = sqlite3.connect('Recitation')
c= db.cursor()

In [19]:
stmt= ('CREATE TABLE Student ' +
       '(sid INTEGER NOT NULL, ' +
        'name CHAR(20), ' +
        'PRIMARY KEY (sid)); ')
c.execute(stmt)

In [20]:
c.execute('INSERT INTO Student (sid,name) VALUES (1, \"Jill\");')
c.execute('INSERT INTO Student (sid,name) VALUES (2, \"Bo\");')
c.execute('INSERT INTO Student (sid,name) VALUES (3, \"Maya\");')

In [21]:
stmt= ('CREATE TABLE Course ' +
       '(cid INTEGER NOT NULL, ' +
        'sem CHAR(5), ' +
        'subj CHAR(20),' +
        'PRIMARY KEY (cid, sem)); ')
c.execute(stmt)

In [22]:
c.execute('INSERT INTO Course (cid,sem,subj) VALUES (550, \"S15\", \"DB\");')
c.execute('INSERT INTO Course (cid,sem,subj) VALUES (677, \"S15\", \"Algo\");')
c.execute('INSERT INTO Course (cid,sem,subj) VALUES (521, \"F15\", \"AI\");')
c.execute('INSERT INTO Course (cid,sem,subj) VALUES (700, \"S17\", \"BigData\");')

In [23]:
stmt= ('CREATE TABLE Professor ' +
       '(fid INTEGER NOT NULL, ' +
       ' name CHAR(20), ' +
        'PRIMARY KEY (fid)); ')
c.execute(stmt);

In [24]:
c.execute('INSERT INTO Professor (fid,name) VALUES (11, \"Ives\");')
c.execute('INSERT INTO Professor (fid,name) VALUES (12, \"Khanna\");')
c.execute('INSERT INTO Professor (fid,name) VALUES (15, \"Davidson\");')
c.execute('INSERT INTO Professor (fid,name) VALUES (18, \"Marcus\");')

In [25]:
stmt= ('CREATE TABLE Teaches ' +
       '(fid INTEGER NOT NULL, ' +
       ' cid INTEGER NOT NULL, ' +
        'sem CHAR(5), ' +
        'PRIMARY KEY (cid, sem)); ')
c.execute(stmt)

In [26]:
c.execute('INSERT INTO Teaches (fid,cid,sem) VALUES (11, 550, \"S15\");')
c.execute('INSERT INTO Teaches (fid,cid,sem) VALUES (12, 677, \"S15\");')
c.execute('INSERT INTO Teaches (fid,cid,sem) VALUES (18, 521, \"F15\");')
c.execute('INSERT INTO Teaches (fid,cid,sem) VALUES (11, 700, \"S17\");')
c.execute('INSERT INTO Teaches (fid,cid,sem) VALUES (15, 550, \"F16\");')

In [27]:
stmt= ('CREATE TABLE Takes ' +
       '(sid INTEGER NOT NULL, ' +
       ' cid INTEGER NOT NULL, ' +
        'sem CHAR(5), ' +
        'grade CHAR(2),' +
        'PRIMARY KEY (sid, cid, sem)); ')
c.execute(stmt)

In [28]:
c.execute('INSERT INTO Takes (sid,cid,sem,grade) VALUES (1, 550, \"S15\", \"A\");')
c.execute('INSERT INTO Takes (sid,cid,sem,grade) VALUES (1, 677, \"S15\", \"A\");')
c.execute('INSERT INTO Takes (sid,cid,sem,grade) VALUES (3, 550, \"S15\", \"C\");')
c.execute('INSERT INTO Takes (sid,cid,sem,grade) VALUES (3, 521, \"F15\", \"C\");')
c.execute('INSERT INTO Takes (sid,cid,sem,grade) VALUES (3, 700, \"S17\", \"A\");')

In [29]:
pd.read_sql_query('select * from Student',con=db)

   sid  name
0    1  Jill
1    2    Bo
2    3  Maya

In [30]:
pd.read_sql_query('select * from Course',con=db)

   cid  sem     subj
0  550  S15       DB
1  677  S15     Algo
2  521  F15       AI
3  700  S17  BigData

In [31]:
pd.read_sql_query('select * from Professor',con=db)

   fid      name
0   11      Ives
1   12    Khanna
2   15  Davidson
3   18    Marcus

In [32]:
pd.read_sql_query('select * from Teaches',con=db)

   fid  cid  sem
0   11  550  S15
1   12  677  S15
2   18  521  F15
3   11  700  S17
4   15  550  F16

In [33]:
pd.read_sql_query('select * from Takes',con=db)

   sid  cid  sem grade
0    1  550  S15     A
1    1  677  S15     A
2    3  550  S15     C
3    3  521  F15     C
4    3  700  S17     A